tutorials/surfaceTracking/interTrackFoam/tank3D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (0.15 0 0)
    (0.4 0 0)
    (0.5 0 0)

    (0 0.15 0)
    (0.15 0.15 0)
    (0.4 0.15 0)
    (0.5 0.15 0)

    (0 0.4 0)
    (0.15 0.4 0)
    (0.4 0.4 0)
    (0.5 0.4 0)

    (0 0.5 0)
    (0.15 0.5 0)
    (0.4 0.5 0)
    (0.5 0.5 0)

    //
    (0 0 0.3)
    (0.15 0 0.3)
    (0.4 0 0.3)
    (0.5 0 0.3)

    (0 0.15 0.3)
    (0.15 0.15 0.3)
    (0.4 0.15 0.3)
    (0.5 0.15 0.3)

    (0 0.4 0.3)
    (0.15 0.4 0.3)
    (0.4 0.4 0.3)
    (0.5 0.4 0.3)

    (0 0.5 0.3)
    (0.15 0.5 0.3)
    (0.4 0.5 0.3)
    (0.5 0.5 0.3)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (12 12 24) simpleGrading (1 1 0.5)
    hex (1 2 6 5 17 18 22 21) (20 12 24) simpleGrading (1 1 0.5)
    hex (2 3 7 6 18 19 23 22) (8 12 24) simpleGrading (1 1 0.5)
    hex (4 5 9 8 20 21 25 24) (12 20 24) simpleGrading (1 1 0.5)
    hex (5 6 10 9 21 22 26 25) (20 20 24) simpleGrading (1 1 0.5)
    hex (6 7 11 10 22 23 27 26) (8 20 24) simpleGrading (1 1 0.5)
    hex (8 9 13 12 24 25 29 28) (12 8 24) simpleGrading (1 1 0.5)
    hex (9 10 14 13 25 26 30 29) (20 8 24) simpleGrading (1 1 0.5)
    hex (10 11 15 14 26 27 31 30) (8 8 24) simpleGrading (1 1 0.5)
);

edges
(
);

patches
(
    patch freeSurface
    (
        (16 17 21 20)
        (17 18 22 21)
        (18 19 23 22)
        (20 21 25 24)
        (21 22 26 25)
        (22 23 27 26)
        (24 25 29 28)
        (25 26 30 29)
        (26 27 31 30)
    )

    patch inlet
    (
        (4 5 1 0)
    )

    patch outlet
    (
        (14 15 11 10)
    )

    wall bottom
    (
        (5 6 2 1)
        (6 7 3 2)
        (8 9 5 4)
        (9 10 6 5)
        (10 11 7 6)
        (12 13 9 8)
        (13 14 10 9)
    )

    wall side-1
    (
        (3 7 23 19)
        (7 11 27 23)
        (11 15 31 27)
    )

    wall side-2
    (
        (15 14 30 31)
        (14 13 29 30)
        (13 12 28 29)
    )

    symmetryPlane symm-1
    (
        (0 1 17 16)
        (1 2 18 17)
        (2 3 19 18)
    )

    symmetryPlane symm-2
    (
        (12 8 24 28)
        (8 4 20 24)
        (4 0 16 20)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
